josuegarciajuan/cerraduras/docs/esp32-qr-reader/scanner-relay-prod.ino
// ── Relé ────────────────────────────────────────────────────────────────────
void relayOn()  { pinMode(RELAY_PIN, OUTPUT); digitalWrite(RELAY_PIN, LOW); }
void relayOff() { pinMode(RELAY_PIN, INPUT); }

void relayPulse() {
  Serial.println("[RELAY] → ON (abriendo pestillo)");
  relayOn();
  relayOffAt = millis() + OPEN_DURATION_MS;
  relayPulsing = true;
  // Fase 1: relayOff() se ejecuta de forma no bloqueante en loop()
}

// F33: Test seguro de cerradura — pulso de 5ms en relay (no activa solenoide)
// Verifica integridad del circuito: GPIO → transistor → relé → bobina
// El solenoide necesita ≥50ms para moverse; 5ms es imperceptible
bool checkLock() {
  pinMode(RELAY_PIN, OUTPUT);
  digitalWrite(RELAY_PIN, LOW);          // activa relay (active-low)
  delayMicroseconds(LOCK_CHECK_US);      // 5ms = 5000µs
  digitalWrite(RELAY_PIN, HIGH);         // desactiva relay
  pinMode(RELAY_PIN, INPUT);             // vuelta a tri-state
  Serial.printf("[LOCK-CHECK] pulso %dµs en GPIO%d — OK\n", LOCK_CHECK_US, RELAY_PIN);
  return true;  // si llegamos aquí, el circuito responde
}

// ── Conectar WiFi leyendo credenciales de NVS ──────────────────────────────
// Devuelve true si conectó, false si hay que pasar a WiFiManager.
bool connectWithNvs() {
  Preferences prefs;
  prefs.begin("cerraduras", true);  // read-only
  String ssid = prefs.getString("ssid", "");
  String pass = prefs.getString("pass", "");
  prefs.end();

  if (ssid.length() == 0) {
    Serial.println("[WIFI] NVS vacío — se necesita provisioning.");
    return false;
  }

  Serial.printf("[WIFI] Conectando con NVS → SSID=%s...\n", ssid.c_str());
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid.c_str(), pass.c_str());

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) { // ~15s timeout
    delay(500);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    wifiConnectedFeedback();
    return true;
  }

  Serial.println("\n[WIFI] Falló conexión con NVS.");
  return false;
}

bool hasStoredWifi() {
  Preferences prefs;
  prefs.begin("cerraduras", true);
  bool present = prefs.getString("ssid", "").length() > 0;
  prefs.end();
  return present;
}

// ── WiFiManager provisioning ────────────────────────────────────────────────
void startWiFiManager() {
  String apSsid = "Cerraduras-Setup-" + chipId();
  Serial.printf("\n[WiFiManager] Iniciando AP: %s\n", apSsid.c_str());
  Serial.println("[WiFiManager] Conectate a esta red con un movil y configura el WiFi.");

  WiFiManager wm;
  wm.setConfigPortalTimeout(300); // 5 minutos de timeout
  // autoConnect: si no hay credenciales guardadas, inicia AP
  // Si hay credenciales guardadas pero fallaron, las usa y reinicia automáticamente.
  bool connected = wm.autoConnect(apSsid.c_str());

  if (!connected) {
    Serial.println("[WiFiManager] Timeout. Reiniciando...");
    delay(1000);
    ESP.restart();
  }

  wifiConnectedFeedback();

  // Guardar credenciales en NVS desde WiFiManager
  Preferences prefs;
  prefs.begin("cerraduras", false);
  prefs.putString("ssid", WiFi.SSID());
  prefs.putString("pass", WiFi.psk());
  prefs.end();
  Serial.printf("[WiFiManager] NVS guardado: SSID=%s\n", WiFi.SSID().c_str());
}

// ── ensureWiFi: garantiza conexión WiFi usando NVS ──────────────────────────
bool ensureWiFi() {
  if (WiFi.status() == WL_CONNECTED) return true;

  Preferences prefs;
  prefs.begin("cerraduras", true);
  String ssid = prefs.getString("ssid", "");
  String pass = prefs.getString("pass", "");
  prefs.end();

  if (ssid.length() == 0) return false;  // sin credenciales

  WiFi.disconnect();
  delay(500);
  WiFi.begin(ssid.c_str(), pass.c_str());
  for (int i = 0; i < 20 && WiFi.status() != WL_CONNECTED; i++) delay(500);
  return WiFi.status() == WL_CONNECTED;
}

// ── Identify: notificar estado del botón a la API ─────────────────────────
void sendIdentify(bool state) {
  if (!ensureWiFi()) {
    Serial.println("[IDENTIFY] Sin WiFi — no se puede enviar");
    return;
  }
  String id   = chipId();
  String body;
  body.reserve(200);  // Fase 1: pre-allocate to prevent heap fragmentation
  body = "{\"external_id\":\"" + id + "\",\"state\":" + (state ? "true" : "false") + "}";
  HTTPClient http;
  beginApiRequest(http, String(API_BASE_URL) + "/api/v1/devices/identify");
  http.addHeader("Content-Type", "application/json");
  addDeviceAuth(http);
  http.setTimeout(1500);
  int code = http.POST(body);
  String resp = http.getString();
  http.end();
  Serial.printf("[IDENTIFY] state=%s → HTTP %d %s\n", state ? "true" : "false", code, resp.c_str());

  if (code == 200) {
    HTTPClient hb;
    beginApiRequest(hb, String(API_BASE_URL) + "/dashboard-api/device-heartbeat");
    hb.addHeader("Content-Type", "application/json");
    addDeviceAuth(hb);
    hb.setTimeout(2000);
    hb.POST("{\"external_id\":\"" + id + "\",\"sub_kind\":\"RPI\"}");
    hb.end();
  }
}

// ── setup ─────────────────────────────────────────────────────────────────
void setup() {
  Serial.begin(115200);
  delay(3000);
  deviceFactoryKey = loadOrCreateFactoryKey();

  relayOff();
  pinMode(IDENTIFY_PIN, INPUT_PULLUP);
  lastIdentifyState = digitalRead(IDENTIFY_PIN);
  if (lastIdentifyState == LOW) {
    Serial.println("[FACTORY-RESET] Botón mantenido durante arranque: esperando liberación...");
    factoryResetProvisioning();
    while (digitalRead(IDENTIFY_PIN) == LOW) delay(20);
    delay(250);
    ESP.restart();
  }

  String id = chipId();
  Serial.println("\n==============================================");
  Serial.println(" ESP32-S3 QR Reader + Relay (v5-dbg — QR diagnostics + hex dump)");
  Serial.println(" Device ID: " + id);
  Serial.println(" Relay pin: GPIO" + String(RELAY_PIN) + " (ACTIVE-LOW tri-state)");
  Serial.println("==============================================");
  Serial.println("");
  Serial.println("  🔧 PRIMER INICIO: si no hay WiFi guardada,");
  Serial.println("     este dispositivo creara la red:");
  Serial.println("     >> Cerraduras-Setup-" + id + " <<");
  Serial.println("");
  Serial.println("  🏷️  PEGATINA: Cerraduras-Setup-" + id);
  Serial.println("");

  scanned.reserve(512);
  pendingQr.reserve(512);

  // ── WiFi: wipe NVS si firmware nuevo → NVS → connect → WiFiManager ───
  clearNvsIfNewFirmware();    // si versión != stored → wipe NVS + restart
  WiFi.setAutoReconnect(true);
  WiFi.persistent(false);

  // Fase 1: TWDT con timeout 60s (RF-1.1). loopTask NO se vigila hasta el 1er
  // loop(), por lo que el provisioning largo en setup() (WiFiManager, hasta 5 min)
  // ya es seguro sin pausar ni borrar la suscripción. No usar
  // esp_task_wdt_delete(NULL): loopTask aún no está suscrito aquí y generaría un
  // `task_wdt: delete_entry: task not found` benigno en cada arranque.
  //
  // API del watchdog según core: Arduino-ESP32 core 3.x (IDF 5.x) cambió la firma
  // de esp_task_wdt_init() a un config-struct. Guard para mantener compilable el
  // sketch también en core 2.x (IDF 4.x), donde la firma era (timeout_sec, panic).
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t wdt_cfg = {
      .timeout_ms     = 60000,   // RF-1.1: 60s
      .idle_core_mask = 0,       // no vigilar idle tasks (igual que hoy)
      .trigger_panic  = true,    // panic/reinicio al expirar
  };
  esp_task_wdt_init(&wdt_cfg);
#else
  esp_task_wdt_init(60, true);   // Arduino core 2.x (IDF 4.x)
#endif

  bool hadStoredWifi = hasStoredWifi();
  bool nvsConnected = connectWithNvs();

  if (!nvsConnected && !hadStoredWifi) {
    startWiFiManager();
  } else if (!nvsConnected) {
    Serial.println("[WIFI] Credenciales existentes no conectan; portal bloqueado. Usa reset de fábrica explícito.");
  }

  // ── USB Host callbacks ──────────────────────────────────────────────
  usb.setKeyboardLayout(ESP_USB_HOST_KEYBOARD_LAYOUT_EN_US);

  usb.onDeviceConnected([](const EspUsbHostDeviceInfo &device) {
    Serial.print("\n══════════════════════════════════════════\n");
    Serial.print("[USB] DISPOSITIVO CONECTADO:\n");
    espUsbHostPrint(device);
    Serial.print("[USB] Listo. Escanea un QR...\n");
    Serial.print("══════════════════════════════════════════\n\n");
    scannerConnected = true;  // F33: track USB HID scanner presence
    if (ensureWiFi()) {
      HTTPClient hScan;
      beginApiRequest(hScan, String(API_BASE_URL) + "/dashboard-api/device-heartbeat");
      hScan.addHeader("Content-Type", "application/json");
      addDeviceAuth(hScan);
      hScan.setTimeout(3000);
      int sc = hScan.POST("{\"external_id\":\"" + chipId() + "\",\"sub_kind\":\"SCANNER\"}");
      String sr = hScan.getString();
      hScan.end();
      Serial.printf("[USB] SCANNER heartbeat → HTTP %d %s\n", sc, sr.c_str());
    }
  });

  usb.onDeviceDisconnected([](const EspUsbHostDeviceInfo &device) {
    Serial.print("\n[USB] desconectado: ");
    espUsbHostPrint(device);
    scannerConnected = false;  // F33: USB scanner disconnected
  });

  usb.onKeyboard([](const EspUsbHostKeyboardEvent &event) {
    if (!event.pressed) return;
    if (event.ascii == '\r' || event.ascii == '\n') {
      if (scanned.length() > 0) {
        // ── v5-dbg: diagnóstico completo ANTES de filtrar ──────────
        // Trim whitespace que el scanner GM65 pueda añadir (CR, LF, espacios)
        scanned.trim();

