josuegarciajuan/cerraduras/docs/esp32-qr-reader/scanner-relay-prod.ino
    unsigned long qrStart = millis();
    int code = http.POST(body);
    unsigned long qrElapsed = millis() - qrStart;
    String resp = http.getString();
    http.end();
    esp_task_wdt_reset();  // defensa: feed tras HTTP bloqueante
    yield();

    Serial.printf("[QR] Validación HTTP %d (%lu ms) → %s\n", code, qrElapsed, resp.c_str());

    if (code == 200) {
      Serial.println(">> ACCESO PERMITIDO — Abriendo relé...");
      relayPulse();

      if (ensureWiFi()) {
        esp_task_wdt_reset();  // defensa: feed antes de HTTP bloqueante
        HTTPClient hLock;
        beginApiRequest(hLock, String(API_BASE_URL) + "/dashboard-api/device-heartbeat");
        hLock.addHeader("Content-Type", "application/json");
        addDeviceAuth(hLock);
        hLock.setTimeout(3000);
        int lc = hLock.POST("{\"external_id\":\"" + id + "\",\"sub_kind\":\"LOCK\"}");
        String lr = hLock.getString();
        hLock.end();
        esp_task_wdt_reset();  // defensa: feed tras HTTP bloqueante
        yield();
        Serial.printf("[QR] LOCK heartbeat → HTTP %d %s\n", lc, lr.c_str());
      }
    } else {
      Serial.println(">> ACCESO DENEGADO");
    }
  }

  // Heartbeat cada 30s + F33 command-check
  unsigned long now = millis();
  if (now - lastBeat > 30000) {
    lastBeat = now;

    // ── Fase 1: Heap monitor ──
    unsigned long heap = ESP.getFreeHeap();
    Serial.printf("[HB] Free heap: %lu bytes\n", heap);
    if (heap < 20480) {
      Serial.printf("[HB] ⚠️ ADVERTENCIA: heap bajo (%lu bytes) — posible fuga de memoria\n", heap);
    }

    if (ensureWiFi()) {
      esp_task_wdt_reset();  // defensa: feed antes de cadena HTTP bloqueante
      HTTPClient h;
      beginApiRequest(h, String(API_BASE_URL) + "/api/v1/health");
      h.setTimeout(4000);
      int hc = h.GET();
      String hr = h.getString();
      h.end();
      esp_task_wdt_reset();  // defensa: feed entre HTTP
      yield();
      Serial.printf("[HB] Health check: HTTP %d — %s\n", hc, hr.c_str());

      // F33: send heartbeat with batch sub_kinds for all ESP32 sub-devices
      String hbBody;
      hbBody.reserve(250);  // Fase 1: pre-allocate
      hbBody = "{\"external_id\":\"" + chipId() + "\",\"sub_kinds\":[\"RPI\",\"SCANNER\",\"LOCK\"]}";
      HTTPClient hb;
      beginApiRequest(hb, String(API_BASE_URL) + "/dashboard-api/device-heartbeat");
      hb.addHeader("Content-Type", "application/json");
      addDeviceAuth(hb);
      hb.setTimeout(3000);
      int hbCode = hb.POST(hbBody);
      String hbResp = hb.getString();
      hb.end();
      esp_task_wdt_reset();  // defensa: feed entre HTTP
      yield();
      Serial.printf("[HB] Heartbeat [HTTP %d] %s\n", hbCode, hbResp.c_str());

      // F33: If API reports pending commands, poll and execute them
      if (hbCode == 200 && hbResp.indexOf("\"has_pending_commands\":true") > 0) {
        Serial.println("[F33] Polling pending commands...");
        esp_task_wdt_reset();  // defensa: feed antes de HTTP bloqueante
        HTTPClient cmdPoll;
        beginApiRequest(cmdPoll, String(API_BASE_URL) + "/dashboard-api/pending-command?external_id=" + chipId());
        cmdPoll.setTimeout(3000);
        addDeviceAuth(cmdPoll);
        int cmdCode = cmdPoll.GET();
        String cmdResp = cmdPoll.getString();
        cmdPoll.end();
        esp_task_wdt_reset();  // defensa: feed tras HTTP bloqueante
        yield();
        Serial.printf("[F33] Poll → HTTP %d %s\n", cmdCode, cmdResp.c_str());

        if (cmdCode == 200) {
          // Simple JSON parse to find command_id and command type
          // (no ArduinoJSON — string search is lightweight enough for this)
          int cmdIdStart = cmdResp.indexOf("\"id\":");
          int cmdNameStart = cmdResp.indexOf("\"command\":\"");
          if (cmdIdStart > 0 && cmdNameStart > 0) {
            // Extract command id
            int cmdIdValStart = cmdResp.indexOf(":", cmdIdStart) + 1;
            int cmdIdEnd = cmdResp.indexOf(",", cmdIdValStart);
            if (cmdIdEnd < 0) cmdIdEnd = cmdResp.indexOf("}", cmdIdValStart);
            String cmdIdStr = cmdResp.substring(cmdIdValStart, cmdIdEnd);
            cmdIdStr.trim();
            int cmdId = cmdIdStr.toInt();

            // Extract command name
            int cmdValStart = cmdResp.indexOf("\"", cmdNameStart + 12) + 1;
            int cmdValEnd = cmdResp.indexOf("\"", cmdValStart);
            String cmdName = cmdResp.substring(cmdValStart, cmdValEnd);

            Serial.printf("[F33] Executing command #%d: %s\n", cmdId, cmdName.c_str());

            if (cmdName == "check") {
              // Verify SCANNER: USB HID keyboard connected?
              bool scannerOk = scannerConnected;

              // Verify LOCK: 5ms relay pulse test
              bool lockOk = checkLock();

              // RPI is always online if we're executing this
              Serial.printf("[F33] SCANNER=%s LOCK=%s RPI=true\n",
                            scannerOk ? "ok" : "offline", lockOk ? "ok" : "offline");

              // Report results
              String resultBody;
              resultBody.reserve(350);  // Fase 1: pre-allocate
              resultBody = "{\"command_id\":" + String(cmdId) +
                                   ",\"external_id\":\"" + chipId() + "\"" +
                                   ",\"results\":{" +
                                   "\"RPI\":true," +
                                   "\"SCANNER\":" + String(scannerOk ? "true" : "false") + "," +
                                   "\"LOCK\":" + String(lockOk ? "true" : "false") +
                                   "}}";

              HTTPClient cmdResult;
              beginApiRequest(cmdResult, String(API_BASE_URL) + "/dashboard-api/command-result");
              cmdResult.addHeader("Content-Type", "application/json");
              addDeviceAuth(cmdResult);
              cmdResult.setTimeout(3000);
              int resCode = cmdResult.POST(resultBody);
              String resResp = cmdResult.getString();
              cmdResult.end();
              esp_task_wdt_reset();  // defensa: feed tras HTTP bloqueante
              yield();
              Serial.printf("[F33] Command result POST → HTTP %d %s\n", resCode, resResp.c_str());
            } else {
              Serial.printf("[F33] Unknown command: %s — skipping\n", cmdName.c_str());
            }
          } else {
            Serial.println("[F33] No command data in response");
          }
        } else {
          Serial.printf("[F33] Poll failed (HTTP %d)\n", cmdCode);
        }
      }
    }
  }

  // ── Identify button ─────────────────────────────────────────────────
  bool raw = digitalRead(IDENTIFY_PIN);
  if (raw != lastIdentifyState) {
    if (now - identifyDebounce > IDENTIFY_DEBOUNCE_MS) {
      lastIdentifyState = raw;
      identifyPending   = true;
      pendingState      = (raw == LOW);
      Serial.printf("\n[IDENTIFY] flanco → state=%s\n", pendingState ? "true (pulsado)" : "false (suelto)");
    }
    identifyDebounce = now;
  }

  if (lastIdentifyState == LOW && now - lastIdentifyPrint > 500) {
    lastIdentifyPrint = now;
    Serial.printf("[IDENTIFY] PULSANDO... (%s)\n", chipId().c_str());
  }

  if (identifyPending) {
    identifyPending = false;
    sendIdentify(pendingState);
  }

  // ── Fase 1: Relé no bloqueante ──
  if (relayPulsing && millis() > relayOffAt) {
    relayOff();
    relayPulsing = false;
    Serial.println("[RELAY] → OFF (pestillo cerrado)");
  }

  // ── Fase 1: LED feedback no bloqueante ──
  if (ledOffAt && millis() > ledOffAt) {
    digitalWrite(LED_PIN, LOW);
    ledOffAt = 0;
    Serial.println("[OK] LED apagado");
  }

  // ── Fase 1: WiFi watchdog — reinicio si >2 min sin conexión ──
  if (WiFi.status() != WL_CONNECTED) {
    if (wifiDownSince == 0) {
      wifiDownSince = millis();
      Serial.println("[WIFI] Conexión perdida — contador 120s para reinicio");
    } else if (millis() - wifiDownSince > 120000) {
      Serial.println("[WIFI] 120s sin conexión — ESP.restart()");
      delay(500);
      ESP.restart();
    }
  } else {
    wifiDownSince = 0;
  }

  // ── Fase 39: inventario auxiliar, después de QR/USB/heartbeat/identify ──
  // HTTPClient usa el timeout corto mínimo disponible; no hay delay ni bucle de espera.
  esp_task_wdt_reset();  // defensa: feed antes del posible HTTP de announce
  announceFactoryDevice(now);
  esp_task_wdt_reset();  // defensa: feed tras el posible HTTP de announce
  yield();
}
